#. 딕셔너리: 각 원소를 키와 값의 쌍으로 표현하고 쉼표로 구분한 후 중괄호로 감싸며 키는 원소를 구분하는 기준이므로 한 딕셔너리 내에서 중복 불가.
price = {"짜장면": 6000, "짬뽕": 7000, "탕수육": 20000}
print(price["짜장면"]) #. 6000
price["짬뽕밥"] = 7500
print(price["짬뽕밥"]) #. 원소 추가
del(price["짜장면"]) #. 원소 삭제
price["탕수육"] = 25000 #. 원소 값 수정
print(price)

fruit = {"사과": 2000, "포도": 3500, "오렌지": 4500}
print(fruit.keys()) #. 딕셔너리의 모든 키
print(fruit.values()) #. 딕셔너리의 모든 값
print(fruit.items()) #. 딕셔너리의 모든 키와 값의 쌍의 리스트 [('키', 값) ... ]

school = {
    "1반": [
        {"이름": "김민수", "성적": {"수학": 90, "과학": 88, "영어": 94}},
        {"이름": "박서연", "성적": {"수학": 82, "과학": 95, "영어": 88}},
    ],
    "2반": [
        {"이름": "이지훈", "성적": {"수학": 61, "과학": 95, "영어": 56}},
        {"이름": "최윤아", "성적": {"수학": 89, "과학": 83, "영어": 100}},
    ],
    "3반": [
        {"이름": "정하윤", "성적": {"수학": 77, "과학": 87, "영어": 95}},
        {"이름": "송태민", "성적": {"수학": 84, "과학": 96, "영어": 46}},
    ],
}
print("1반 김민수 수학")
print(school["1반"][0]["성적"]["수학"]) #.90
print("3반 정하윤 영어")
print(school["3반"][0]["성적"]["영어"]) #.95

#. 현재 환율 정보
exchange_rates = {"USD": 1200, "EUR": 1400, "JYP": 11}
print("---------- 환율 정보 추가/수정 ----------")
key = input("추가하거나 수정할 통화 입력")
value = int(input(f"{key}의 현재 환율 금액을 입력하세요:"))
exchange_rates[key] = value
print(exchange_rates.items())
print("------------- 환율 계산기 -------------")
currency = input(f"통화({list(exchange_rates.keys())})를 입력하세요")
price = int(input(f"변환할 금액({currency})을 입력하세요"))
print(f"환율 계산 결과: {exchange_rates[key] * price}")